app/views/departments/index.html.erb

    <td><%=department.students.count %></td>
    <td><%=department.courses.count %></td>
---
SELECT COUNT(*) FROM "courses" WHERE "courses"."department_id" = $1  [["department_id", 4]]