app/controllers/courses_controller.rb

  def show
    if current_user.role == 'admin'
    @course = Course.find(params[:id])
    @teachers = User.where.not(teacher_department_id:nil)
    @departments = Department.all
    else
      @course = Course.find(params[:id])
      @teachers = User.where(teacher_department_id:@course.department_id)
      @departments = Department.where(id:@course.department_id)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]