app/controllers/courses_controller.rb

  def new
    @teachers = User.where.not(teacher_department_id:nil)
    @departments = Department.all
---
SELECT "users".* FROM "users" WHERE "users"."teacher_department_id" IS NOT NULL
SELECT "departments".* FROM "departments"

  def create
    # render json: params[:course]
    @course = Course.new(course_params)
    # render json: @course
    if @course.save
---
INSERT INTO "courses" ("course_code", "teacher_id", "department_id", "created_at", "updated_at", "course_title", "course_credit", "semester") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def edit
    @course = Course.find(params[:id])
    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "courses" SET "teacher_id" = $1, "department_id" = $2, "updated_at" = $3 WHERE "courses"."id" = $4  [["teacher_id", 13], ["department_id", 8], ["updated_at", "2022-03-14 09:59:09.250362"], ["id", 17]]

  def edit_from_department
    @course = Course.find(params[:id])
    if @course.update(course_params)
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
UPDATE "courses" SET "updated_at" = $1, "course_credit" = $2 WHERE "courses"."id" = $3  [["updated_at", "2022-03-14 04:48:43.882883"], ["course_credit", 3.2], ["id", 17]]

  def show
    @course = Course.find(params[:id])
    @teachers = User.where.not(teacher_department_id:nil)
    @departments = Department.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."teacher_department_id" IS NOT NULL
SELECT "departments".* FROM "departments"

  def show_from_department
    @course = Course.find(params[:id])
    @teachers = User.where.not(teacher_department_id:nil)
    @departments = Department.all
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."teacher_department_id" IS NOT NULL
SELECT "departments".* FROM "departments"

  def destroy_from_department
    @course = Course.find(params[:id])
    if @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 16]]

  def destroy
    @course = Course.find(params[:id])
    if @course.destroy
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = $1  [["id", 8]]