app/controllers/departments_controller.rb

SELECT "users".* FROM "users" WHERE "users"."department_head_department_id" IS NOT NULL
---
  def new
    @department = Department.new
    @departmentHeads = User.where.not(department_head_department_id:nil)

INSERT INTO "departments" ("department_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["department_name", "CSE"], ["created_at", "2022-03-13 06:28:08.570546"], ["updated_at", "2022-03-13 06:28:08.570546"]]
---
  def store
    @department = Department.new(department_params)
    # render json: @department
    if @department.save

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "departments" SET "department_name" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["department_name", "CSE1"], ["updated_at", "2022-03-13 12:49:53.912342"], ["id", 4]]
---
  def update
    @department = Department.find(params[:id])
    if @department.update(department_params)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 6]]
---
  def destroy
    @department = Department.find(params[:id])
    if @department.destroy