app/controllers/users_controller.rb

SELECT "departments".* FROM "departments"
---
  def edit
    @role = "teacher"
    @departments = Department.all

UPDATE "users" SET "name" = $1, "student_department_id" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "orin"], ["student_department_id", 7], ["updated_at", "2022-03-15 11:08:50.517095"], ["id", 34]]
---
  def update
    @create_user_params=nil
    @role = params[:user][:role]
    # render json: @role
    if @role =='student'
      @create_user_params = student_params

    elsif @role =='teacher'
      @create_user_params = teacher_params
    end
    if current_user.update(student_params)

SELECT "departments".* FROM "departments"
---
  def new
    if request.path == "/create_student"
      @role = 'student'
    elsif request.path == "/create_teacher"
      @role = 'teacher'
    end
    @user = user_from_params
    departments = Department.all
    info =[]
    departments.each do |department|

INSERT INTO "users" ("name", "student_department_id", "teacher_department_id", "department_head_department_id", "created_at", "updated_at", "email", "phone", "password_digest", "address", "encrypted_password", "confirmation_token", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    # render json: params
    @role = user_params.delete(:role)
    @user = user_from_params
    if @user.save

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def user_from_params
    email = user_params.delete(:email)
    password = user_params.delete(:password)
    phone = user_params.delete(:phone)
    address = user_params.delete(:address)
    name = user_params.delete(:name)

    if @role == 'student'
      student_department = user_params.delete(:student_department)
    elsif @role == 'teacher'
      teacher_department = user_params.delete(:teacher_department)
    end

    Clearance.configuration.user_model.new(user_params).tap do |user|
      user.email = email
      user.password = password
      user.name = name
      user.phone = phone
      user.address = address
      if !user.email.nil?
        if @role == "student"
          user.student_department = Department.find(student_department)
        elsif @role == "teacher"
          user.teacher_department = Department.find(teacher_department)

SELECT "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "department_head_department_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["department_head_department_id", 4], ["updated_at", "2022-03-15 10:25:16.203648"], ["id", 26]]
---
  def departmentHeadUpdate
    # render json: params
    @department = Department.find(params[:department_id])
    #
    @user = User.find(params[:department_head_id])
    if !@department.department_head.nil?
      @department.department_head.update({ :department_head_department_id=> nil })
    end
    if @user.update({ :department_head_department_id=> @department.id })