app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
  def viewedByOthers
    @user = User.find(params[:id])

SELECT "departments".* FROM "departments"
---
  def edit
    if current_user.role == 'admin'
      redirect_to profile_path, notice: "admin can't update your profile"
    end
    @role = current_user.role
    @departments = Department.all